sergz72/PIC/unfinished/Charger_PIC24FV16KM202.X/mcc_generated_files/mssp1_i2c.h
        This function does not send the transaction. To send the transaction,
        the TRB insert function (MSSP1_I2C_MasterTRBInsert()) must be called.

    @Preconditions
        None

    @Param
        *ptrb - A pointer to a caller supplied TRB.

    @Param
        *pdata - A pointer to the block of data to be sent

    @Param
        length - The length of the data block to be sent

    @Param
        address - The address of the i2c peripheral to be accessed

    @Returns
        None

    @Example
        <code>
            Refer to MSSP1_I2C_MasterTRBInsert() for an example	
        </code>

*/

void MSSP1_I2C_MasterWriteTRBBuild(
                                MSSP1_I2C_TRANSACTION_REQUEST_BLOCK *ptrb,
                                uint8_t *pdata,
                                uint8_t length,
                                uint16_t address);

                         
/**
    @Summary
        This function returns the empty status of the Master
        queue.

    @Description
        This function returns the empty status of the Master
        queue. Use this function to check if the queue is empty.
        This can verify if the Master is currently idle.

    @Preconditions
        None

    @Param
        None

    @Returns
        True if the queue is empty and false if the queue is not empty.

    @Example
        <code>
            #define MCHP24AA512_ADDRESS    0x50 // slave device address

            // check until queue is empty
            while(MSSP1_I2C_MasterQueueIsEmpty() == false);
            
            // now send more data (assume readBuffer is initialized)
            MSSP1_I2C_MasterRead(   readBuffer,
                                    3,
                                    MCHP24AA512_ADDRESS,
                                    &status);   
  
        </code>

*/

bool MSSP1_I2C_MasterQueueIsEmpty(void);


/**
    @Summary
        This function returns the full status of the Master
        queue.

    @Description
        This function returns the full status of the Master
        queue. Use this function to check if the queue is full.
        This can verify if the Master will not be able to accept
        addition transactions.

    @Preconditions
        None

    @Param
        None

    @Returns
        True if the queue is full and false if the queue is not full.

    @Example
        <code>
            #define MCHP24AA512_ADDRESS    0x50 // slave device address
 
            // check until queue has space
            while(MSSP1_I2C_MasterQueueIsFull() == true);
            
            // now send more data (assume readBuffer is initialized)
            MSSP1_I2C_MasterRead(   readBuffer,
                                    3,
                                    MCHP24AA512_ADDRESS,
                                    &status); 
        </code>

*/

bool MSSP1_I2C_MasterQueueIsFull(void);


#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_MSSP1_I2C_H
    
/**
 End of File
*/
